void Logo(void) {
	puts("");
	puts("                                 ============================");
	puts("");
	puts("                                   XX  XX  YY  YY  NN    NN  ");
	puts("                                    XXXX    YYYY   NNNN  NN  ");
	puts("                                     XX      YY    NN NN NN  ");
	puts("                                    XXXX     YY    NN  NNNN  ");
	puts("                                   XX  XX    YY    NN    NN  ");
	puts("");
	puts("");
	puts("                                  Пенкин Станислав гр ИВТ-11 ");
	puts("");
	puts("                                 ============================");
	puts("");
	puts("==========================================================================================================");
	puts("                     В списке целых ненулевых чисел заменить последовательности");
	puts("                  отрицательных чисел с количеством чисел >3 на среднее арифме-");
	puts("                  тическое этих чисел.");
	puts("==========================================================================================================");
	puts("        Благодарность Семенову Диме и Глозштейну Александру Моисеевичу за предоставленные функции.");
	puts("==========================================================================================================");
	puts("");
}

int Help(int *i) {
	if (*i) {
		puts("==========================================================================================================");
		puts("-- Конфигурационный файл программы находится в папке программы. Без него программа работать не будет.");
		puts("-- Описание параметров находится в конфигурационном файле. В случае если параметры не корректны, программа");
		puts("будет использовать параметры по умолчанию.");
		puts("-- Файл лога программы находится в папке пограммы. ");
		puts("==========================================================================================================");
		puts("");
		return(0);
	}
	return(1);
}

